---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireConduitType
source: html/b8763d38-f4db-8e2b-58be-0b142bcadfa6.htm
---
# WireConduitType Methods

Causes the object to release immediately any resources it may be utilizing.